IDEA Open Model
LoadCase Properties
Compatible with IDEA StatiCa Beta 20.0
The LoadCase type exposes the following members.
Properties
Name | Description
Id
 Element Id
 (Inherited from OpenElementId.)
IsActive
 active load case/combination
 (Inherited from CalculationCase.)
Load
 Load
LoadCaseType
 Type of load case
Name
 Gets or set the name
 (Inherited from CalculationCase.)
Top
See Also
Reference
LoadCase Class
IdeaRS.OpenModel.Detail.Loading Namespace